Revit 2023 API
FabricSheet.BentFabricStraightWiresLocation Property
 Specifies the location of straight bars with respect to bent bars in the fabric sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2017
Syntax
C#
public BentFabricStraightWiresLocation BentFabricStraightWiresLocation { get; set; }
Visual Basic
Public Property BentFabricStraightWiresLocation As BentFabricStraightWiresLocation
	Get
	Set
Visual C++
public:
property BentFabricStraightWiresLocation BentFabricStraightWiresLocation {
	BentFabricStraightWiresLocation get ();
	void set (BentFabricStraightWiresLocation value);
}
Remarks
 This parameter applies only to bent fabric sheets. The side on wich straight wires will be loacted is determined by the start and end point of the first bent profile segment that specifies the direction of the curve loop on plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: the data-setting method is not applicable to fabric sheets that are flat
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidObjectException |  When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace